## Learn Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.Series(data = [1,2,3,4,5], index = ['a','b','c','d','e'])

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
dict = {'1':7, '2':4, 'h':5}

In [4]:
dict

{'1': 7, '2': 4, 'h': 5}

In [5]:
pd.Series(dict)

1    7
2    4
h    5
dtype: int64

In [6]:
mySeriesOne = pd.Series([1,2,3,4,5], ['a', 'b', 'c', 'd', 'e'])

In [7]:
mySeriesTwo = pd.Series([1,2,7,4,2], ['a', 'b', 'c', 'f', 'e'])

In [8]:
mySeriesOne + mySeriesTwo

a     2.0
b     4.0
c    10.0
d     NaN
e     7.0
f     NaN
dtype: float64

In [9]:
from numpy.random import randn

In [10]:
myData = randn(3,4)

In [31]:
myData

array([[ 0.39255924, -1.76607551, -0.38385216,  0.20890414],
       [-0.87862287, -0.35929013,  1.21731597, -0.42425378],
       [-0.41394392,  0.06345708,  0.12753111,  0.30158931]])

In [11]:
myDataFrame = pd.DataFrame(myData, ['R1','R2','R3'], ['C1', 'C2', 'C3','C4'])

In [12]:
myDataFrame

          C1        C2        C3        C4
R1  0.392559 -1.766076 -0.383852  0.208904
R2 -0.878623 -0.359290  1.217316 -0.424254
R3 -0.413944  0.063457  0.127531  0.301589

In [14]:
myDataFrame['C1']

R1    0.392559
R2   -0.878623
R3   -0.413944
Name: C1, dtype: float64

In [15]:
myDataFrame ['C5']  = myDataFrame['C1']* myDataFrame['C3']

In [16]:
myDataFrame

          C1        C2        C3        C4        C5
R1  0.392559 -1.766076 -0.383852  0.208904 -0.150685
R2 -0.878623 -0.359290  1.217316 -0.424254 -1.069562
R3 -0.413944  0.063457  0.127531  0.301589 -0.052791

In [22]:
myDataFrame['C1']

R1    0.392559
R2   -0.878623
R3   -0.413944
Name: C1, dtype: float64

In [23]:
myDataFrame.drop('C2', axis=1, inplace=True)

In [24]:
myDataFrame

          C1        C3        C4        C5
R1  0.392559 -0.383852  0.208904 -0.150685
R2 -0.878623  1.217316 -0.424254 -1.069562
R3 -0.413944  0.127531  0.301589 -0.052791

In [25]:
myDataFrame.loc['R1']

C1    0.392559
C3   -0.383852
C4    0.208904
C5   -0.150685
Name: R1, dtype: float64

In [33]:
dict

{'1': 7, '2': 4, 'h': 5}

In [27]:
myDict = pd.Series(dict)

In [28]:
myDict

1    7
2    4
h    5
dtype: int64

In [32]:
myDict

1    7
2    4
h    5
dtype: int64

In [36]:
# DictFrame = pd.DataFrame(myDict, [1], ['a','b','c'])

In [37]:
myDataFrame.loc[['R1','R2'], ['C4', 'C5']]

          C4        C5
R1  0.208904 -0.150685
R2 -0.424254 -1.069562

In [38]:
myDataFrame

          C1        C3        C4        C5
R1  0.392559 -0.383852  0.208904 -0.150685
R2 -0.878623  1.217316 -0.424254 -1.069562
R3 -0.413944  0.127531  0.301589 -0.052791

In [39]:
myDataFrame.loc[['R2','R3'], ['C1', 'C3']]

          C1        C3
R2 -0.878623  1.217316
R3 -0.413944  0.127531

In [40]:
myDataFrame >0

       C1     C3     C4     C5
R1   True  False   True  False
R2  False   True  False  False
R3  False   True   True  False

In [41]:
myDataFrame[myDataFrame > 0]

          C1        C3        C4  C5
R1  0.392559       NaN  0.208904 NaN
R2       NaN  1.217316       NaN NaN
R3       NaN  0.127531  0.301589 NaN

In [42]:
myDataFrame [myDataFrame['C3']>0]

          C1        C3        C4        C5
R2 -0.878623  1.217316 -0.424254 -1.069562
R3 -0.413944  0.127531  0.301589 -0.052791

In [43]:
myDataFrame[myDataFrame['C5']>0]

Empty DataFrame
Columns: [C1, C3, C4, C5]
Index: []